{
    "internationalizations": [
        {
            "language": "en",
            "description": "Enthusiastic Python Full Stack Developer with a Passion for Crafting Digital Solutions.<br><br>As a budding Python Full Stack Developer, I bring a fresh perspective and a deep enthusiasm for creating comprehensive web applications. My journey into the world of programming has equipped me with a strong foundation in both front-end and back-end technologies. With a keen eye for detail and a commitment to delivering high-quality code, I am eager to contribute my skills to dynamic projects that push the boundaries of innovation.<br><br>My proficiency in Python empowers me to seamlessly navigate the complexities of back-end development, where I excel in designing and implementing robust server-side logic and databases. Additionally, my familiarity with front-end technologies like HTML, CSS, and JavaScript allows me to create user-centric interfaces that prioritize aesthetics and functionality.<br><br>As a newcomer to the field, I thrive on continuous learning and collaboration, recognizing that the tech landscape is ever-evolving. My adaptability, coupled with a strong problem-solving mindset, ensures that I can overcome challenges while maintaining a positive and proactive attitude.<br><br>With a drive to contribute to impactful projects, I am excited to learn, grow, and leverage my skills as a Python Full Stack Developer. My passion for coding, combined with my dedication to mastering the art of full stack development, positions me as a valuable asset in creating engaging and efficient digital solutions."
        }
    ],
    "medias": [        
        {
            "icon": "linkedin",
            "title": "LinkedIn",
            "http": "https://www.linkedin.com/in/aswin-stevin-683524224/"
        },
        {
            "icon": "github",
            "title": "GitHub",
            "http": "https://github.com/Aswinstev"
        },
        {
            "icon": "whatsapp",
            "title": "Whatsapp",
            "http": "https://wa.me/+971552989059"
        },
        {
            "icon": "instagram",
            "title": "Instagram",
            "http": "https://www.instagram.com/aswin__stevin/"
        }
    ],
    "hobbies": [        
        {
            "icon": "music",
            "title": "Music"
        },
        {
            "icon": "dumbbell",
            "title": "Gym"
        },
        {
            "icon": "suitcase-rolling",
            "title": "Travel"
        },
        {
            "icon": "futbol",
            "title": "Sports"
        },
        {
            "icon": "laptop",
            "title": "Tech"
        }
    ]
}