{
    "internationalizations": [
        {
            "language": "en",
            "description": "As the world around us continues to evolve, Artificial Intelligence has established to be a field which exponentially embarks into our day-to-day capacity. In the quest to expand my knowledge horizons, I have constantly aimed at pursuing diverse interests and in addition to academic proficiency, I have taken it on myself to explore how computer science can be used to identify and solve open problems. I am an enthusiast in Research and Game development. I am keen about taking on new projects that help me explore new aspects of Machine Learning, or broadly Artificial Intelligence.<br><br> Currently, my research revolves around ML and IoT. In 2020, I published my first research under the supervision of Dr. Sung-Hyuk Cha and Dr. Yoo-Jung Ann which was based on Computer Vision wherein, I used Ensemble methods and came up with a new metric that helped in achieving better results. I took a lot of time to evaluate this metric and after applying it on several datasets and different classes along with combination of several different ML algorithms, I published a second paper in 2021, where I evaluated the formula on Multiple Class Classification.<br><br> I have also tried to play around with Statistical Parameters wherein, we used BCI as an application and evaluated EEG signals using 7 statistical parameters. Recently, I have been co-working on a medical journal alongside Dr. Altion Simo, where we are using IoT and Machine Learning to collect data using WIREPAS and wearable devices to track and evaluate ADL of the silver tsunami coming our way, when it comes to seniors residing in the USA. This paper is discussing a system that is used to draw reports on the behavior progression for seniors. After introducing a very resilient mesh system on collecting high quality data from the home environment where the seniors live, we propose comparatively different methods in finding the best results on machine learning analyses when it comes to calculating projections, trends, seasonalities and other parameters related to their behavior.<br><br> My Future Goals are to pursue a PhD where I am able to gain expertise in Artificial Intelligence, Algorithms, gameplay systems and probablistic inferential learning. I am enthusiastic about these domains and wish to continue research in the same. I am keen, hard-working and have been looking for opportunities where I can step into the field. I am only a beginner and feel that there is a lot that I have to learn."
        }
    ],
    "medias": [
        {
            "icon": "linkedin",
            "title": "LinkedIn",
            "http": "https://www.linkedin.com/in/vaibhav-katturu-559787185/"
        },
        {
            "icon": "github",
            "title": "GitHub",
            "http": "https://github.com/vaiv26"
        },
        {
            "icon": "google",
            "title": "Google",
            "http": "https://scholar.google.com/citations?user=aI0-WxYAAAAJ&hl=en&oi=ao"
        }
    ],
    "hobbies": [
        {
            "icon": "biking",
            "title": "Cycling"
        },
        {
            "icon": "futbol",
            "title": "Soccer"
        },
        {
            "icon": "suitcase-rolling",
            "title": "Travel"
        },
        {
            "icon": "gamepad",
            "title": "Playing video Games"
        }
    ]
}
