{
    "internationalizations": [
        {
            "language": "it",
            "description": "Sin da piccolo sono sempre stato appassionato del mondo digital e di tutto ciò che vive attorno ad esso,<br><br>amo scrivere codice ed imparare nuovi linguaggi di programmazione.<br><br>Dammi un notebook, del codice da scrivere, una tazza di caffè e mi vedrai felice,almeno finché il codice non inizierà a buggarsi.<br><br>L'altra faccia della medaglia, amante dello sport.<br><br>Pratico a livello amatoriale vari sport: corsa, cross-training, arrampicata, nuoto, snowboard e calcio.<br><br>Quando non sono davanti ad un pc per programmare pratico sport, molti week-end li dedico alle gare di corsa, alle Ocr e alle Spartan race.<br><br>Pieno di energia! sono una persona attiva che non si tira indietro,come nel lavoro, così nella vita privata.Amo viaggiare, conoscere nuove persone, scoprire posti nuovi immersi nella natura.Quando non faccio follie come lanciarmi con il paracadute mi aggiorno nel campo della programmazione, leggo o guardo serie tv"
        },
        {
            "language": "en",
            "description": "Since I was a child I have always been passionate about the digital world and everything that lives around it,<br><br>I love writing code and learning new programming languages.<br><br>Give me a notebook, some code to write, a cup of coffee and you'll see me happy,at least until the code starts to bug.<br><br>The other side of the coin: sports lover.<br><br>I practice various sports at an amateur level: running, cross-training, climbing, swimming, snowboarding and soccer.<br><br>When I'm not in front of a PC to plan sports, I dedicate many weekends to running races, OCR and Spartan races.Full of energy! I am an active person who does not hold back,as in work, so in private life.I love travelling, meeting new people, discovering new places surrounded by nature.When I'm not doing crazy things like skydiving, I'm learning programming, reading or watching TV series"
        }
    ],
    "medias": [        
        {
            "icon": "linkedin",
            "title": "LinkedIn",
            "http": "https://www.linkedin.com/in/marco-polello-a762b0175/"
        },
        {
            "icon": "github",
            "title": "GitHub",
            "http": "https://github.com/marcopolello"
        },
        {
            "icon": "facebook",
            "title": "Facebook",
            "http": "https://www.facebook.com/marco.pol.54"
        },
        {
            "icon": "instagram",
            "title": "Instagram",
            "http": "https://www.instagram.com/marco_pol_94/"
        }
    ],
    "hobbies": [        
        {
            "icon": "biking",
            "title": "Cycling"
        },
        {
            "icon": "dumbbell",
            "title": "Gym"
        },
        {
            "icon": "suitcase-rolling",
            "title": "Travel"
        },
        {
            "icon": "book",
            "title": "Read"
        }
    ]
}