{
    "internationalizations": [
        {
            "language": "pt",
            "description": "Minha caminhada como <i>programador</i> teve início aos nove anos de idade quando me apaixonei pelo <i>Logo</i>, uma linguagem de programação educacional usada para cativar crianças nas maravilhosas terras da <i>Programação</i>. Costumava passar horas seguidas tentando criar figuras e animações, usando matemática e geometria. Naquela época, eu simplesmente não conhecia os desafios emocionantes que ainda estavam por vir.<br><br>Alguns anos depois, consegui um estágio como <i>Webmaster</i>, desde então, nunca mais parei, sendo mais de uma década, onde venho tendo a chance de trabalhar com pessoas maravilhosas, aprendendo todos os dias, viajando pelo mundo e, principalmente, sempre fazendo grandes amizades.<br><br>Tive experiência como empreendedor, quando um amigo apresentou-me <i>Magento</i>, um framework de comércio eletrônico extremamente popular. Depois de fazer vários cursos e muita prática, consegui contratos com agências de São Paulo e Rio de Janeiro, Brasil. Essa experiência de empreendedorismo me deu a chance de ver o outro lado da moeda, o que contribuiu para expandir um pouco mais minha consciência como colaborador.<br><br>Atualmente, continuo buscando novas habilidades, aprendendo e compartilhando meu humilde conhecimento, tanto quanto possível."
        },
        {
            "language": "en",
            "description": "My interest in <i>programming</i> started early on, when I was first introduced to computer science in school. I also loved playing video games, and as I got older, I became fascinated with the technology behind them.<br><br>While I am relatively new to the field, I have just completed a rigorous and highly respected boot camp program at <i>Hack Reactor</i>. Through this program, I gained valuable hands-on experience and learned a wide range of skills that I am excited to apply to real-world projects.On this site, you will find examples of my work, including three projects that I am particularly proud of. In addition to my technical skills, I am committed to ongoing learning and personal growth.<br><br>"
        }
    ],
    "medias": [
        {
            "icon": "linkedin",
            "title": "LinkedIn",
            "http": "https://www.linkedin.com/in/soslant/"
        },
        {
            "icon": "gitlab",
            "title": "GitLab",
            "http": "https://gitlab.com/SoslanT"
        }
    ],
    "hobbies": [
        {
            "icon": "camera",
            "title": "Photography"
        },
        {
            "icon": "dumbbell",
            "title": "Gym"
        },
        {
            "icon": "chess",
            "title": "Chess"
        },
        {
            "icon": "snowboarding",
            "title": "Snowboard"
        }
    ]
}
